#include <avr/io.h>	/*библиотека с именами регистров*/
#define F_CPU 8000000	/*тактовая частота процессора*/
#include <util/delay.h>	/*библиотека пауз*/

/*НАЧАЛО ГЛАВНОЙ ПРОГРАММЫ*/
int main(void)
{
	DDRB = 0b11111111;	//настройка всех контактов на вывод
	while(1)			//бесконечный цикл
	{					//начало
		PORTB = 0b11111111;	//зажигаем все светодиоды
		_delay_ms(500);		//пауза 0,5 с
		PORTB = 0b00000000;	//гасим все светодиоды
		_delay_ms(500);		////пауза 0,5 с
	}	//конец бесконечного цикла
}		//конец главной функции
